<template>
    <div class="city-box">
        <div>
            <h4>定位城市</h4>
            <ul class='ul'>
                <li class='li'>{{dingwei}}</li>
            </ul>
        </div>
        <div>
            <h4>最近访问城市</h4>
            <ul class='ul'>
                <li class='li' v-for="item in recentlyCity" :key="item">{{item}}</li>
            </ul>
        </div>
        <div>
            <h4>热门城市</h4>
            <ul class='ul'>
                <li class='li' v-for="item in hotCity" :key="item" @click="gofrom(item)">{{item}}</li>
            </ul>
        </div> 
       <mt-index-list>
        <mt-index-section v-for="list in cityList" :index="list.index" :key="list.index">
            <mt-cell v-for="item in list.title" :title="item" :key="item" @click.native="gofrom(item)"></mt-cell>
        </mt-index-section>
        </mt-index-list> 
    </div>
</template>

<script>
export default {
    data() {
        return {
            dingwei:'定位未成功',
            recentlyCity:['广州'],
            hotCity:['上海','北京','广州','武汉','深圳','天津','西安','南京','杭州','成都','重庆'],
            cityList:[{
                index:'A',
                title:['阿拉善盟','鞍山','安庆','安阳','阿坝','安顺','安康','阿勒泰','阿克苏','安吉','安丘','安岳','安平','安宁','安溪','安化','阿勒泰市','安福','阿荣旗','安陆市','安州区','阿城区']
            },{
                index:'B',
                title:['北京','保定','蚌埠','包头','本溪','巴彦淖尔','白城','白山','亳州','滨州','巴中','北海','百色','毕节','保山','宝鸡','白银','巴州','博尔塔拉','滨海','宝应','北流','博爱','北碚','宝丰','泌阳','博兴','博山','璧山','彬州市','宾阳','博白县','博罗县','北镇市','泊头市','北安市','巴彦县']
            },{
                index:'C',
                title:['重庆','成都','长沙','常州','长春','沧州','承德','赤峰','长治','朝阳','池州','巢湖','潮州','郴州','常德','崇左','楚雄','昌吉','从化','常熟','长乐','长兴','慈溪','昌邑','长葛','苍南','承德县','赤壁','崇州','淳安','曹妃甸','昌乐', '磁县','昌黎','岑溪','成安','长垣', '曹县','长汀','城固','赤水','常山','长寿','潮安','长丰县','茶陵','常宁县','苍溪县','慈利','澄迈县','长清区','崇明区','成武县','澄江县']  
            },{
                index:'D', 
                title:["大连","东莞","大理","丹东","大庆","大同","大兴安岭","德宏","德阳","德州","定西","迪庆","东营"]
            },{
                index:'E',
                title:["鄂尔多斯","恩施","鄂州"]
            },{
                index:'F',
                title:["福州","防城港","佛山","抚顺","抚州","阜新","阜阳"]
            },{
                index:'G',
                title:["广州","桂林","贵阳","甘南","赣州","甘孜","广安","广元","贵港","果洛"]
            },{
                index:'H',
                title:["杭州","哈尔滨","合肥","海口","呼和浩特","海北","海东","海南","海西","邯郸","汉中","鹤壁","河池","鹤岗","黑河","衡水","衡阳","河源","贺州","红河","淮安","淮北","怀化","淮南","黄冈","黄南","黄山","黄石","惠州","葫芦岛","呼伦贝尔","湖州","菏泽"]
            },{
                index:'I',
                title:[]
            },{
                index:'J',
                title:["济南","佳木斯","吉安","江门","焦作","嘉兴","嘉峪关","揭阳","吉林","金昌","晋城","景德镇","荆门","荆州","金华","济宁","晋中","锦州","九江","酒泉"]
            },{
                index:'K',
                title:["昆明","开封"]
            },{
                index:'L',
                title:["兰州","拉萨","来宾","莱芜","廊坊","乐山","凉山","连云港","聊城","辽阳","辽源","丽江","临沧","临汾","临夏","临沂","林芝","丽水","六安","六盘水","柳州","陇南","龙岩","娄底","漯河","洛阳","泸州","吕梁"]
            },{
                index:'M',
                title:["马鞍山","茂名","眉山","梅州","绵阳","牡丹江"]
            },{
                index:'N',
                title:["南京","南昌","南宁","宁波","南充","南平","南通","南阳","那曲","内江","宁德","怒江"]
            },{
                index:'O',
                title:[]
            },{
                index:'P',
                title:["盘锦","攀枝花","平顶山","平凉","萍乡","莆田","濮阳"]
            },{
                index:'Q',
                title:["青岛","黔东南","黔南","黔西南","庆阳","清远","秦皇岛","钦州","齐齐哈尔","泉州","曲靖","衢州"]
            },{
                index:'R',
                title:["日喀则","日照"]
            },{
                index:'S',
                title:["上海","深圳","苏州","沈阳","石家庄","三门峡","三明","三亚","商洛","商丘","上饶","山南","汕头","汕尾","韶关","绍兴","邵阳","十堰","朔州","四平","绥化","遂宁","随州","宿迁","宿州"]
            },{
                index:'T',
                title:["天津","太原","泰安","泰州","台州","唐山","天水","铁岭","铜川","通化","通辽","铜陵","铜仁","台湾"]
            },{
                index:'U',
                title:[]
            },{
                index:'V',
                title:[]
            },{
                index:'W',
                title:["武汉","乌鲁木齐","无锡","威海","潍坊","文山","温州","乌海","芜湖","乌兰察布","武威","梧州"]
            },{
                index:'X',
                title:["厦门","西安","西宁","襄樊","湘潭","湘西","咸宁","咸阳","孝感","邢台","新乡","信阳","新余","忻州","西双版纳","宣城","许昌","徐州","香港","锡林郭勒","兴安"]
            },{
                index:'Y',
                title:["银川","雅安","延安","延边","盐城","阳江","阳泉","扬州","烟台","宜宾","宜昌","宜春","营口","益阳","永州","岳阳","榆林","运城","云浮","玉树","玉溪","玉林"]
            },{
                index:'Z',
                title:["杂多县","赞皇县","枣强县","枣阳市","枣庄","泽库县","增城市","曾都区","泽普县","泽州县","札达县","扎赉特旗","扎兰屯市","扎鲁特旗","扎囊县","张北县","张店区","章贡区","张家港","张家界","张家口","漳平市","漳浦县","章丘市","樟树市","张湾区","彰武县","漳县","张掖","漳州","长子县","湛河区","湛江","站前区","沾益县","诏安县","召陵区","昭平县","肇庆","昭通","赵县","昭阳区","招远市","肇源县","肇州县","柞水县","柘城县","浙江","镇安县","振安区","镇巴县","正安县","正定县","正定新区","正蓝旗","正宁县","蒸湘区","正镶白旗","正阳县","郑州","镇海区","镇江","浈江区","镇康县","镇赉县","镇平县","振兴区","镇雄县","镇原县","志丹县","治多县","芝罘区","枝江市","芷江侗族自治县","织金县","中方县","中江县","钟楼区","中牟县","中宁县","中山","中山区","钟山区","钟山县","中卫","钟祥市","中阳县","中原区","周村区","周口","周宁县","舟曲县","舟山","周至县","庄河市","诸城市","珠海","珠晖区","诸暨市","驻马店","准格尔旗","涿鹿县","卓尼","涿州市","卓资县","珠山区","竹山县","竹溪县","株洲","株洲县","淄博","子长县","淄川区","自贡","秭归县","紫金县","自流井区","资溪县","资兴市","资阳"]
            }]
        }
    },
    methods: {
        gofrom(item){
        	let path = this.$route.query.path
        	if(this.$route.query.path){
        		this.$router.push({path:path})
        	}else{
        		this.$router.push({name:'cinemaindex',query:{item}})
        	}
            
        },
        
    },
    watch:{
       '$route'(to,from){
       	 console.log(1)
       }
    },
}
</script>

<style scoped>
.city-box{
    z-index: 100;
}
    div h4{
        font-size: 14px;
        line-height: 30px;
        margin: 0;
        padding-left: 15px;
        color:#333;
    }
    /* div span{
        background: #fff;
        height: 33px;
        margin-top: 15px;
        margin-left: 4%;
        padding: 0 4px;
        border: 1px solid #e6e6e6;
        border-radius: 3px;
        line-height: 33px;
        text-align: center;
        box-sizing: border-box;
    } */
    .ul{
        margin: 0;
        padding: 0;
        background-color: #f5f5f5;
        padding-bottom: 8px;
        padding-right: 30px;
        overflow: hidden;
    }
    .ul .li{
        list-style: none;
        font-size: 14px;
        color: #333;
        float: left;
        background: #fff;
        width: 29%;
        height: 33px;
        margin-top: 15px;
        margin-left: 4%;
        padding: 0 4px;
        border: 1px solid #e6e6e6;
        border-radius: 3px;
        line-height: 33px;
        text-align: center;
        box-sizing: border-box;
        white-space: nowrap;
    }
</style>
